//app.js
App({
  globalData:{
    collectName:[],
    province:'',
    city:'',
    district:'',
    listIndex:[],
    listMeat: [],
    listShui:[],
    listDou:[],
    listFriut:[],
    listVegetable:[],
    listIndexN: ['生菜', '大豆', '芹菜', '玉米', '菠菜', '芒果', '土豆', '山药', '莲藕', '冬笋',
      '丝瓜', '尖椒', '茄子', '黄瓜', '冬瓜', '香菇', '香梨', '苹果', '葡萄', '黄桃', '蜜桔', '草莓', '西瓜',
      '牛肉', '羊肉'],

    listMeatN: ['仔猪', '良种猪', '猪肉(白条猪)', '猪颈背肌肉', '猪前腿肌肉', '猪后腿肌肉', '猪大排肌肉',
      '猪肚', '猪肾', '猪肝', '猪心', '猪肺', '猪大肠', '肥膘', '黄牛', '水牛', '山母羊', '山羯羊', '绵羊',
      '活鸡', '三黄鸡', '三黄公鸡', '老母鸡', '白条鸡', '柴鸡', '乌鸡', '活鸭', '活鹅', '活兔', '鸡蛋', '红皮鸡蛋',
      '白皮鸡蛋', '鸭蛋', '猪皮', '毛猪', '黄花母鸡', '黄花公鸡', '麻花母鸡', '麻花公鸡', '牦牛', '山羊'],

    listVegetableN: ['花生', '大白菜', '洋白菜', '油菜', '小白菜', '木耳菜', '茼蒿', '苋菜', '香菜', '油麦菜', '芥菜',
     '空心菜', '折耳根(鱼腥草)', '韭菜', '韭苔', '葱', '小葱', '蒜苗', '茴香', '萝卜', '红萝卜', '白萝卜', '水萝卜', '心里美萝卜', '胡萝卜',
      '芋头', '福鼎芋', '良薯', '葱头', '大葱', '生姜', '大蒜', '红蒜5.0公分', '红蒜6.0公分', '白蒜5.0公分', '白蒜6.0公分', '西洋芹', 
      '莴笋', '青笋', '茭白', '慈菇', '马蹄', '菜苔', '蒜薹', '儿菜', '香椿', '竹笋', '绿豆芽', '黄豆芽', '韭黄', '韭菜花', '菜花',
      '西兰花', '西红柿', '樱桃西红柿', '绿尖椒', '红尖椒', '青椒', '红椒', '圆茄子', '长茄子', '光皮黄瓜', '西葫芦', '苦瓜', 
      '南瓜', '青冬瓜', '菜瓜', '佛手瓜', '瓠子', '菱角', '豆角', '荷兰豆', '豇豆', '豌豆', '豌豆尖', '毛豆', '鲜食玉米', '蘑菇', '平菇',
       '凤尾菇', '杏鲍菇', '白灵菇', '金针菇', '草菇', '茶树菇', '鸡腿菇', '木耳', '黑木耳', '银耳', '猴头菇', '玉米棒', '真姬菇'],

    listFriutN: ['甘蔗', '雪莲果', '富士苹果', '红香蕉苹果', '黄元帅苹果', '蛇果', '红星苹果', '秦冠苹果', '嘎拉苹果', '乔纳金苹果', '青苹果',
     '黄香蕉苹果', '梨', '鸭梨', '雪梨', '酥梨', '苹果梨', '花盖梨', '丰水梨', '白梨','柿子', '山楂', '巨峰葡萄', '龙眼葡萄', '青提子', 
      '红提子', '马奶葡萄', '玫瑰香葡萄', '肥猪', '石榴', '猕猴桃', '桃子', '蟠桃', '油桃', '李子', '布朗', '杏子', '樱桃', '枣', '冬枣', '红枣',
      '金丝枣', '大枣', '青枣', '橘、柑','年桔', '芦柑', '砂糖橘', '椪柑', '橙子', '广柑', '脐橙', '甜橙', '常山胡柚', '沙田柚','四季柚', '柠檬',
      '香蕉', '菠萝', '荔枝', '荔枝(桂味)', '荔枝(妃子笑)', '龙眼(桂圆)', '龙眼(乌圆)', '象牙芒', '芒果(金煌芒)', '田阳香芒', '芒果(象牙22号)',
      '芒果(台农一号)', '芒果(红贵妃）', '木瓜', '红毛丹', '枇杷', '人参果', '山竹', '杨桃', '椰子', '特小凤西瓜', '黑美人西瓜', '麒麟西瓜', '京欣西瓜', 
      '甜瓜', '伊丽沙白瓜', '红城十甜瓜', '网纹瓜', '香瓜', '黄河蜜', '伽师瓜', '哈密瓜', '国光苹果', '石榴(甜石榴)', '白桃', '黄金瓜', '蕉柑'],

    listShuiN: ['花鲢活鱼', '白鲢活鱼', '活草鱼', '活鲫鱼', '活鲤鱼', '鳊鱼', '黑鱼', '活鳜鱼', '虹鳟鱼', '罗非鱼', '鲶鱼', '养殖鲶鱼', '野生鲶鱼',
     '三文鱼', '白鳝鱼', '黄鳝', '泥鳅', '武昌鱼', '带鱼', '大带鱼', '小带鱼', '大黄花鱼', '小黄花鱼', '鲈鱼', '鲳鱼', '大平鱼', '小平鱼', '海鳗',
      '连尖', '加吉鱼', '鲅鱼', '鮸鱼', '石斑鱼', '对虾','淡水虾', '龙虾', '澳洲龙虾', '基围虾', '甲鱼', '人工甲鱼', '野生甲鱼', '乌龟', 
      '梭子蟹', '肉蟹', '青蟹', '珍宝蟹', '江蟹', '扇贝', '鲍鱼', '蛏子', '蛤蜊', '海参', '海蛎', '淡菜', '紫菜'],

    listDouN: ['面粉', '标准粉', '特一粉', '特二粉', '早籼稻', '晚籼稻', '大米', '籼米(晚籼米)', '粳米(普通)', '糯米','绿豆', '红小豆', 
    '花生仁', '葵花籽', '黑大片葵花籽', 'S33(油葵)', '芝麻(白芝麻)', '条形辣椒干（小米椒）', '圆形辣椒干（珠子椒）', '圆形辣椒干（草莓椒）',
     '圆形辣椒干（子弹头）', '条形辣椒干（二荆条）', '条形辣椒干（长线椒）', '辣椒干', '葡萄干(特级)', '葡萄干(通货)', '全提子葡萄干', '红马奶葡萄干', 
     '绿马奶葡萄干', '板栗', '核桃', '核桃(杂343)', '枸杞子', '枸杞二级', '一级豆油(散装)', '花生油', '香油', '菜油(散装)', '色拉油', '棕榈油',
      '黄芪（瓜子片0.3）', '黄芪（指甲片0.8 - 1.0）', '黄芪（圆片0.5 - 0.8）', '党参（厚片0.4）', '党参（药厂货）', '党参（节0.6 - 0.8）']
    
  },
  setWatcher(data, watch) {
    Object.keys(watch).forEach(v => {
      this.observe(data, v, watch[v]);
    }
    )
  },

  observe(obj, key, watchFun) {
    var val = obj[key]
    Object.defineProperty(obj, key, {
      configurable: true,
      enumerable: true,
      set: function (value) {
        val = value
        watchFun(value, val)
      },
      get: function () {
        return val
      }
    })
  },
  onShow: function () {
    wx.checkSession({
      success() {
        //session_key 未过期，并且在本生命周期一直有效
        // wx.removeStorageSync("id")
        console.log("session_key 未过期")
      },
      fail() {
        // session_key 已经失效，需要重新执行登录流程
        wx.login({
          success(res) {
            if (res.code) {
              //发起网络请求
              wx.request({
                url: 'https://yekejie.xyz/Login',
                data: {
                  code: res.code
                },
                // method: "POST",
                success: res => {
                  console.log(res.data)
                  var idback = res.data.id
                  wx.getStorageInfo({
                    success(res) {
                      console.log(res.keys)
                      if (res.keys.indexOf('id') == -1) {
                        // console.log(idback)
                        wx.setStorageSync('id', idback)
                      }
                      // if (res.keys.indexOf('is_new') == -1)
                      //   wx.setStorageSync('is_new', isNew)
                      // console.log(wx.getStorageSync('id'))
                    }
                  })
                },
                fail: res => {
                  console.log("请求id失败")
                }
              })
            } else {
              console.log('登录失败！' + res.errMsg)
            }
          }
        })
      }
    })
  }
})